{"elements": ["RT @SooperMexican: Apparently @trscoop and I were the only ones who noticed Cruz was right of Trump on immigration 2 months ago https://t.c…", "RT @AnnCoulter: Trump's immigration plan=“the definition of compassion,” by prioritizing interests of ppl living here\" Trump advisor https:…", "RT @benshapiro: Cruz Tried to Outflank Trump on Immigration. It Won't Work. Here's Why. | Daily Wire https://t.co/OAqBDeNyet https://t.co/1…", "If it comes down to #Trump/ #Rubio, immigration will make Marco a HUGE target. #gopclowncar https://t.co/gZhDeUcsQf", "RT @realDonaldTrump: Remember that Marco Rubio is very weak on illegal immigration. South Carolina needs strength as illegals and Syrians p…", "Illegal Immigration is out of control. Trump is the only one talking about it.  https://t.co/QpNgJzsfgy", "@MattWalshBlog Immigration is NOT his only issue.  I like Trump and I've never liked a celebrity in my life.  You're being ridiculous!", "RT @MattWalshBlog: Funny thing is, exit polls show Trump voters don't care about immigration. They're just infatuated by celebrity, that's …", "@ZehDuck if Donald trump would vow to ban Italian immigration he would have my support", "RT @kausmickey: Trump immigration adviser: He would tell “the entire world that the day when you can come here illegally is over.” https://…", "RT @TheBaxterBean: One good thing about Trump's immigration policy is how it deports Rubio and Cruz. #GOPDebate https://t.co/Wqrs3qrz8o htt…", "RT @TheFirstRanger: As an immigration agent, I love how @tedcruz will let us find &amp; deport the 14mil #IllegalAliens in the US. \n\nTrump &amp; Ru…", "RT @reallyraisin: Trump lies about Cruz again - this time on immigration\nhttps://t.co/OzDVTX6FCq\nComprehension isn't really Trump's forte..…", "The #LameStreamMedia and @FoxNews still don't get the @realDonaldTrump phenomena.  It's all about #immigration !!  We want our country back!", "No problems @ immigration Mr. Trump, despite my Iranian visa. US entry stamp on same page! https://t.co/Gg80Y9fzMN", "@billcherylzoe That would be a mistake. Rubio is bad on immigration, but Trump is horrid in so many more areas, namely size/scope of gov't.", "RT @trump2016fan: Breaking: Marco Rubio Promotes Welfare And Citizenship For Illegals In Middle of Americas Immigration Crisis  https://t.c…", "@TrumpCoulter16 @AnnCoulter Its National Security. Immigration is part of, but certain ilk will not be satisfied till lights out n Chicago.", "RT @pxwnews: #Trump on #immigration. #GOPDebate \n\nhttps://t.co/Qq5wQOvfQx https://t.co/SrG4cJeKNb", "RT @DailyCaller: Trump Adviser Explains The Donald’s Immigration Plan: ‘The Definition Of Compassion’\nhttps://t.co/h8XedEchFM https://t.co/…", "How a South Carolina town’s experience with #immigration explains the rise of Donald Trump https://t.co/JboGpy6nQp https://t.co/JgzjEwY0BK", "Trump is concerned about the same things the people have been concerned about. No one else did.NWO,Islamization Immigration,War,Economy,Vets", "RT @FrankSharry: No one gets the political dynamics of the immigration debate the way Sargent does. Spot on analysis of Cruz, Trump. https:…", "RT @jonlovett: Rubio won't stand up to Trump, wilted on immigration, got flustered by Christie. How will he deal with real tyrants like Put…", "RT @newconservny: @theblaze @realDonaldTrump @tedcruz @MarcoRubioDaily got to bring us justice on Rubio. Sold US Out On IMMIGRATION and,TPP…", "RT @chucktodd: History may show that Trump spat with Pope on immigration may have helped get the frontrunner back on his most powerful mess…", "How Trump Won #SCPrimary: Proposals on Illegal Immigration, Muslim Ban @marthamaccallum https://t.co/eTwsUS5nxM https://t.co/YunyRurTIh", "Watch TRUMP's Video Message on Illegal Immigration:  https://t.co/OadctAisWO Via #DTmag #TRUMPTRAIN @manwsstory2 https://t.co/IJUftDCW2N", "RT @KyleKulinski: Anti-immigration Trump just had his immigrant wife Melania speak to an anti-immigration crowd of supporters and they chee…", "RT @NAInfidels: @zenith2feb @YugeMilo @realDonaldTrump Muslim immigration is cultural suicide. They all need to be kept out.", "RT @RobertMenardFR: Les chrétiens attendent du pape qu'il défende la Chrétienté, pas sa submersion par l'immigration... #Trump #Papefrancois", "Is Trump Right To Call For Stopping All  Muslim Immigration To US While Crisis Continues?; I voted Yes, https://t.co/UzvoWFMtjX", "@peddoc63 sounds like you're disappointed...why?  My God, Trump only wants to destroy illegal immigration &amp; Islamic terrorism.", "Trump SC victory speech: Mexico is still going to be paying for the wall https://t.co/sWDSFt9ViS #immigration https://t.co/FedePl01OV", "RT @KennethDurden: Trump's victory speech is as idiotic as usual. Folks I get anger and I oppose illegal immigration, but this is mindless …", "RT @WorldOfStu: .@huitecouture In 2013, Trump told DREAMERS “you’ve convinced me” on immigration. https://t.co/HLnjPQdm4d", "“This year, we’re going to build the wall. Steve King, get up here. Talk to the people about immigration.” - Trump’s State of the Union", "RT @PLeBlanc12: .@realDonaldTrump on immigration \"We'll do the wall... Don't worry we're gonna do the wall.\"", "Trump is not anti-immigration. #eyeroll  https://t.co/KKz6h5UuJs", "His entire speech is geared to double down on anti-immigration thrust, his trump card. This will carry Georgia, Tennessee &amp; Virginia.", "RT @NerdyWonka: #SCPrimary \n\nTrump on immigration: “We’re gonna do the wall.”\n\nWait...What?!\n\nThe wall right now https://t.co/jnmhxq9Hm9", "Mexicans are probably thinking we're gonna be immigrating to their country soon if Trump wins. Hahaha! Reverse illegal immigration.", "RT @pbump: “This year, we’re going to build the wall. Steve King, get up here. Talk to the people about immigration.” - Trump’s State of th…", "RT @Forbes: When it comes to immigration, it looks like Ted Cruz is on the same page as Donald Trump: https://t.co/6JGtUNNhkz https://t.co/…", "@CNN @realDonaldTrump Trump: stop all immigration! Aide: sir, Melania's left you. Trump: Wait, just one more, then we'll do the wall thing.", "https://t.co/DboB4fEz2r Canada's immigration website experiencing an increase in traffic after Trump's SC victory https://t.co/XI1kNPMl3M", "@just4funpolitic @realDonaldTrump Immigration is a serious problem. EU= violence, murders, rape, economy collapse..cant have it here #Trump", "@marcorubio -- Be concise &amp; precise on immigration, then EXPOSE Trump's (&amp; Ted's) lack of foreign policy knowledge in the debate!", "@greta @realDonaldTrump We will not pick a immigration reformer. We will only choose a immigration law enforcer. Rubio sealed fate 2013", "Donald Trump Supports #Amnesty #OpenBorders https://t.co/WOpVyUYwZP #illegalimmigration #SecureBorder #NationalSecurity #election2016", "Whenever you look at Rubio, think these 3 words...WEAK ON IMMIGRATION #WakeUpAmerica  #MakeAmericaGreatAgain #Trump2016 #TrumpTrain #Nevada", "RT @Linda18788: Senator Jeff Sessions on Immigration and China: Trump Has Forced That Into the Discussion  https://t.co/8kaWy28Hs2", "RT @andrewbostom: SC victor Trump; Exit polls: ¾ support Muslim immigration pause; 44% want illegals deported https://t.co/DKv3ILOepN https…", "RT @frankrichny: How long before Trump challenges immigration papers of Rubio's parents? Keep in mind Rubio has told conflicting tales of t…", "The immigration issue has been waiting for 20+ years. Any of these candidates could have grasped it. They all left it for Trump.", "But WALL! Eric Trump: dad's immigration plan includes amnesty after deportation | RedState https://t.co/9cufSrQBHg https://t.co/DUQZAuUZfO", "RT @JeannaEckert: @Tazatator @realDonaldTrump He lied to FL voters on immigration. They hate him! Will say anything 2 get elected. Smooth &amp;…", "Line at immigration in Mexico.  thanks @realDonaldTrump", "TRUMP!!!!!!!! Ted Cruz as Attorney General, John R. Bolton as Secretary of State, Lt. Col. Allen West as Secretary of Defense, Dr. Ben Carson as Surgeon General, Jeff Sessions for Homeland Security and Joe Arpaio for Immigration and Customs Enforcement.", "Cruz is lying as he repeats Trumps'  position on immigration!!   GO TRUMP!!", "When Trump gets elected, his Top 10 TO DO LIST from an Aussie perspective.\n1/Immediate arrest and investigation of CAIR Muslim Brotherhood members.\n2/ Immediate Investigation of Obama and Clinton.\n3/ Immediate halt to Muslim immigration.\n4/ Immediate investigation into mosques.\n5/ Major beefing up of security on the Mexican border.\n6/ Ramping up of Americas Military.\n7/ Political correctness  cancelled.\n8/ Go after ISIS as allies with Russia.\n9/ Go after suspected terrorists in the USA.\n10/ Order Investigation Scalias death and other related deaths.\n\nAlso;\nClose down Obamacare.", "WHY VOTE FOR DONALD TRUMP2016\n1. Donald Trump is the only candidate who can turn things around for America and should be taken seriously!!!\n2. He is immune to special interest lobbying because he has accepted no donations or special interest money. No other candidate can make this claim.\n3. He is an executive. The President of the United States is the Chief Executive Officer of our nation. We dont need a policy expert or a legislator  we need someone who knows how to run an organization. Mr. Trump is the only candidate who has a proven record as a successful executive on a large scale.\n4. He is honest. Mr. Trump is a man who tells the truth. He may not always say it in the most polished way, but our country has had enough suave liars. It is time for some straight forward honesty.\n5. He is decisive. As President every decision he makes would be in the best interest of the country. We hear about his having business interests that filed for bankruptcy. In each case, he looked at the situation as it was, and then he cut his losses. We need someone who will look at government programs realistically and if they are failures; will end the wasteful Washington spending.\n6. He is courageous. Mr. Trump has been viciously attacked by the Washington establishment and the media  and he has not budged one inch. In other words, he is willing to take charge and lead.\n7. He listens. At Trump Presidential events, the audience gets to actually speak to him without being screened, and he responds without a teleprompter.\n8. His success is unmatched in the business world by all the others -\nHe attended one of the best business schools/ to make 10 billion dollars.\n9. Having an IQ of 157, his knowledge of contracts and negotiating is brilliant/ internationally/ unparalleled. No one builds an international business empire the size of Trump's without being able to win at the negotiating table.\n10. He was popular in the Apprentice/ number 1# rated program 10 years running.\n11. He wrote 10 best-selling books [ His book the Art of a deal [educational]\n12. He owns and operates Miss Universe/ Miss America] beauty pageants.\n13. Hes doing business worldwide therefore his experience is desirable/ knows cultures/international taxes/ pricing/ shipping/ unions/ regulations/ contracts/ business/ practices/ suppliers/ safety rules/ types of workers.\n14. Hes into construction, media, manufacturing, travel and publishing.\n15. Hes a job producer/ just for the records/ most of his CEOs are women/ yes they make more than the men/ creditability counts.\n16. He gives millions to charities.\n17. He understands currencies/ money exchanges/ inflation, deflation worldwide wages.\n18. His tax program 0-10-15-25 is simple.\n19. His universal interstate medical/ insurance program is very realistic/ competition.\n20. He has a good five point immigration program.\n21. Hes pro military & Vets [improve VA hospital/care] Take ISIS oil fields to pay Vets.\n22. He wants to seal off the boarder [build that wall] Hes built a 96 story building/ he thinks thats harder than constructing a wall. He understands that a nation without borders, language and laws is not a nation.\n23. Hes anti-Iran deal/ pro-Israel. He says it states we have to protect Iran if Israel attacks [Iran keeps saying they are going to wipe Israel and us off of the map].\n24. His pro Christmas stance is anti [political correct].\n25. He also realizes that our nation is being trashed worldwide and speaks up about it.\n26. He recognizes the China money manipulation policy which is anti-USA.\n27. He says that Japans tariff on US goods [one way deal making].\n28. He wants to put a tariff on Mexican goods/ all traffic/ cut off aid.\n29. Remember when Trump said; we protect Saudi Arabia therefore they must pay.\n30. We fought and spend billions in Afghanistan to help those people and China is mining their minerals because the Obama administration is incompetent/ cant win at negotiating/ stupid leaders.\n31. Hes warning America of [Poisons vaccines] and the dangers.\n32. He wants a high tech military/ a world class military/ hardware/ hacking/ security [too good to fail].\n33. He realizes we have a Muslin problem in this nation.\n34. He thinks Obamas birth certificate is a fraud [check out his SS#, no draft card/ old pass port/ E-verification status, school records [remember his dad isnt American therefore he isnt qualified for the office hes in].\n35. He will work for a $1 per year salary, give the rest to charity and not accept the pension after presidency if elected.\nSUMMARY\nLike him or not, agree with him or not, it doesnt matter. So far Trump is the only candidate who has shown that he can up-set the apple-cart and make things happen and he is exactly what America needs at this point in time! Everybody should do their homework on the candidates. We must not listen to the political media. They are not going to tell you the truth! They have a way of twisting words for their own story and agenda! There is an important choice that each voter has to make. Either you cast your vote for another puppet candidate and support business as usual in Washington again or support Donald Trump and HELP MAKE AMERICA GREAT AGAIN!!!2016", "Written by a Facebook member...a good read..........I've been thinking a lot about Donald Trump, people say that he doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan he's giving you an outline. Why? Every time he brought something to the table, the other candidates take it and run. Such as immigration, the wall and other issues. I can guarantee you that he won't give you his full plans in detail until he standing at the podium next to one of the Democrats. That is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business without a strategy, and a form of negotiation already set. This man is prepared in business and it will be prepared when the time is right in a debate. He is a brilliant man, and he will not reveal his hand. He doesn't have to, he has his supporters. They believe in him, they know he could be the commander in chief and lead this country in the right direction. As far as foreign policy, you say he lacks. What I say is he knows the economy, he knows the about taxes, trade, laws, foreign values, he knows that inside and out because he's dealt with them for so many years. Now if he hadn't been good with dealing with the foreign market, he wouldn't be the billionaire that he is now. He is a international brand. He knows leaders and foreign dignitaries. He is an economic genius with the skills to make this country great again. By bringing businesses back into this country and creating jobs. This will only help our economy. He would protect the United States from those who want to do us harm. He loves this country, and. will do what he has to do to protect it. HE IS bold and brash, he says what he means it means what it says, and that is what we like about him so much. He will be a tough negotiator and our allies will know where he stands at all times. They know his word will mean something, and so will our enemies. This is a brilliant man who has focus and he is pragmatic. He knows how to solve problems quickly. He will surround himself with the best of the best in all branches of the government. You will not see our soldiers kneeling at the feet of Iranian, nor will you see Isis take over the world. You haven't seen the guy work yet. All you've seen is a businessman turned politician before your eyes. His supporters are standing shoulder to shoulder with him and will not sway. Lobbyist and special interest groups will no longer be able to line that pockets of our Congress and Senate. Because when they do, the Senates and congressmen will pass a bills and legislation and it will be a conflict of interest to the United States. No more will you have super PACs running this country. The media can ridicule Donald Trump and his supporters all they want, But we are digging in our heels. We will not be deterred. The fact of the matter is, you think Americans are stupid. But we are the backbone of this country. Americans will determine the vote, not the special special interest groups or the lobbiests. They will finally understood clearly. Our voices will be heard. We will support our troops and build up our military and take care of our vets. Because this administration has not had their backs, nor have they listened to our top military leaders. No longer will our military hands be tied. He will secure our borders and revamp our visa program. He will do everything in his power to keep American safe. He will call our enemies by name, radicals jihadist. There will no longer be political correctness, for it is destroying our country and dividing us. Americans are finally pulling together as one, United we stand, shoulder to shoulder with Donald Trump"], "size": 63}